Animation_For_SciTech2016/case2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    // coordinates of the outer domain
    (-15.3892 -1.8415 0)
    (-0.2341 15.2445 0)
    (0.5 15.2445 0)
    (30.5 15.2445 0)
    (30.5 -0.025207 0)
    (30.5 -17.0755 0)
    (0.5 -17.0755 0)
    (-0.26603 -17.0755 0)
    // Airfoil key coordinates
    (-0.5 -0.021381 0)
    (-0.2341 0.081057 0)
    (0.5 -0.025207 0)
    (-0.26603 -0.062712 0)
    // ************************************************ // 
    // coordinates of the outer domain
    (-15.3892 -1.8415 1)
    (-0.2341 15.2445 1)
    (0.5 15.2445 1)
    (30.5 15.2445 1)
    (30.5 -0.025207 1)
    (30.5 -17.0755 1)
    (0.5 -17.0755 1)
    (-0.26603 -17.0755 1)
    // Airfoil key coordinates
    (-0.5 -0.021381 1)
    (-0.2341 0.081057 1)
    (0.5 -0.025207 1)
    (-0.26603 -0.062712 1)
);

blocks
(
    hex (8 9 1 0 20 21 13 12) (40 100 1) simpleGrading (1 50 1)
    hex (9 10 2 1 21 22 14 13) (40 100 1) simpleGrading (1 50 1)
    hex (10 4 3 2 22 16 15 14) (200 100 1) simpleGrading (20 50 1)
    
    hex (11 8 0 7 23 20 12 19) (40 100 1) simpleGrading (1 50 1)
    hex (10 11 7 6 22 23 19 18) (60 100 1) simpleGrading (1 50 1)
    hex (4 10 6 5 16 22 18 17) (200 100 1) simpleGrading (0.05 50 1)
);

edges
(
    // Arc for the front
    arc 0 1 (-10.0468 9.8528 0)
    arc 12 13 (-10.0468 9.8528 1)
    arc 0 7 (-11.9359 -11.6338 0)
    arc 12 19 (-11.9359 -11.6338 1)
    // Define airfoil top-front surface // 
    spline 8 9
    (
        (-0.49681 -0.010656 0)
        (-0.48887 0.00053064 0)
        (-0.47631 0.011921 0)
        (-0.45929 0.023253 0)
        (-0.43799 0.034269 0)
        (-0.41263 0.044721 0)
        (-0.38344 0.054372 0)
        (-0.3507 0.063008 0)
        (-0.31468 0.070437 0)
        (-0.2757 0.076497 0)
    )
    spline 20 21
    (
        (-0.49681 -0.010656 1)
        (-0.48887 0.00053064 1)
        (-0.47631 0.011921 1)
        (-0.45929 0.023253 1)
        (-0.43799 0.034269 1)
        (-0.41263 0.044721 1)
        (-0.38344 0.054372 1)
        (-0.3507 0.063008 1)
        (-0.31468 0.070437 1)
        (-0.2757 0.076497 1)
    )
    // Define airfoil top-back surface // 
    spline 9 10
    (
        (-0.19022 0.084022 0)
        (-0.14444 0.085335 0)
        (-0.097136 0.084978 0)
        (-0.048725 0.082977 0)
        (0.00037966 0.079397 0)
        (0.049745 0.074347 0)
        (0.098928 0.067977 0)
        (0.14747 0.060473 0)
        (0.1949 0.052059 0)
        (0.24074 0.042986 0)
        (0.28449 0.03353 0)
        (0.32564 0.023981 0)
        (0.3637 0.014634 0)
        (0.39812 0.0057796 0)
        (0.42839 -0.0023156 0)
        (0.45398 -0.0094169 0)
        (0.4744 -0.01534 0)
        (0.48915 -0.019963 0)
        (0.49781 -0.023239 0)
    )
    spline 21 22
    (
        (-0.19022 0.084022 1)
        (-0.14444 0.085335 1)
        (-0.097136 0.084978 1)
        (-0.048725 0.082977 1)
        (0.00037966 0.079397 1)
        (0.049745 0.074347 1)
        (0.098928 0.067977 1)
        (0.14747 0.060473 1)
        (0.1949 0.052059 1)
        (0.24074 0.042986 1)
        (0.28449 0.03353 1)
        (0.32564 0.023981 1)
        (0.3637 0.014634 1)
        (0.39812 0.0057796 1)
        (0.42839 -0.0023156 1)
        (0.45398 -0.0094169 1)
        (0.4744 -0.01534 1)
        (0.48915 -0.019963 1)
        (0.49781 -0.023239 1)
    )
    // Define airfoil bottom-front surface // 
    spline 8 11
    (
        (-0.49835 -0.031398 0)
        (-0.49179 -0.040475 0)
        (-0.48028 -0.048406 0)
        (-0.46382 -0.055016 0)
        (-0.44245 -0.060167 0)
        (-0.41623 -0.063767 0)
        (-0.38529 -0.065776 0)
        (-0.34979 -0.06621 0)
        (-0.30995 -0.065143 0)
    )
    spline 20 23
    (
        (-0.49835 -0.031398 1)
        (-0.49179 -0.040475 1)
        (-0.48028 -0.048406 1)
        (-0.46382 -0.055016 1)
        (-0.44245 -0.060167 1)
        (-0.41623 -0.063767 1)
        (-0.38529 -0.065776 1)
        (-0.34979 -0.06621 1)
        (-0.30995 -0.065143 1)
    )
    // Define airfoil bottom-back surface // 
    spline 11 10
    (
        (-0.2184 -0.059112 0)
        (-0.16748 -0.054591 0)
        (-0.11377 -0.049442 0)
        (-0.05788 -0.043986 0)
        (-0.00049147 -0.038557 0)
        (0.057615 -0.033478 0)
        (0.11558 -0.029035 0)
        (0.1725 -0.025459 0)
        (0.2274 -0.022895 0)
        (0.27935 -0.021398 0)
        (0.32741 -0.020913 0)
        (0.37074 -0.021291 0)
        (0.40859 -0.022289 0)
        (0.44035 -0.023602 0)
        (0.46558 -0.024885 0)
        (0.48399 -0.02579 0)
        (0.49545 -0.025989 0)
    )
    spline 23 22
    (
        (-0.2184 -0.059112 1)
        (-0.16748 -0.054591 1)
        (-0.11377 -0.049442 1)
        (-0.05788 -0.043986 1)
        (-0.00049147 -0.038557 1)
        (0.057615 -0.033478 1)
        (0.11558 -0.029035 1)
        (0.1725 -0.025459 1)
        (0.2274 -0.022895 1)
        (0.27935 -0.021398 1)
        (0.32741 -0.020913 1)
        (0.37074 -0.021291 1)
        (0.40859 -0.022289 1)
        (0.44035 -0.023602 1)
        (0.46558 -0.024885 1)
        (0.48399 -0.02579 1)
        (0.49545 -0.025989 1)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (0 7 19 12)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (3 4 16 15)
            (4 5 17 16)
        );
    }
    
    airfoil
    {
        type wall;
        faces
        (
            (8 9 21 20)
            (9 10 22 21)
            (8 11 23 20)
            (11 10 22 23)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (1 2 14 13)
            (2 3 15 14)
            (7 6 18 19)
            (6 5 17 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
